#+title: Simple Packet Template
** Start Coder
#+begin_src tmate :window coder :dir "../../.."

cd ~/sharingio/coder
rm -rf ~/.config/coderv2/ # delete database
coder server --address=0.0.0.0:7080 --access-url=https://coder.$SHARINGIO_PAIR_BASE_DNS_NAME \
    2>&1 | tee coder-server.log
#+end_src
#+begin_src shell
coder login `cat ~/.config/coderv2/url` -u ii -p ii -e ii@ii.nz
#+end_src

#+RESULTS:
#+begin_example
> Your Coder deployment hasn't been set up!

  Welcome to Coder, ii! You're authenticated.

  Get started by creating a template:  coder templates init
#+end_example
** coder url
#+begin_src shell :dir "../../.."
grep "coder login https://" coder-server.log | cut -d\  -f 4
#+end_src

#+RESULTS:
#+begin_example
https://coder.bobymcbobs.pair.sharing.io
#+end_example


* Not that postgresql is installed
#+begin_src shell
find  ~/Library/Application\ Support/coderv2/postgres | egrep -v 'data/|bin/'
#+end_src

#+RESULTS:
#+begin_example
/Users/hh/Library/Application Support/coderv2/postgres
/Users/hh/Library/Application Support/coderv2/postgres/password
/Users/hh/Library/Application Support/coderv2/postgres/cache
/Users/hh/Library/Application Support/coderv2/postgres/cache/embedded-postgres-binaries-darwin-amd64-13.7.0.txz
/Users/hh/Library/Application Support/coderv2/postgres/bin
/Users/hh/Library/Application Support/coderv2/postgres/runtime
/Users/hh/Library/Application Support/coderv2/postgres/port
/Users/hh/Library/Application Support/coderv2/postgres/data
#+end_example


